def get_dummy_data():
    data = [
        {"category": "战术建议", "time": "2024-10-20 02:15:01", "text": "全队战术执行差，锋线球员被针对。需要调整成熟的战术体系。"},
        {"category": "换人", "time": "2024-10-20 05:35:12", "text": "原因：对方外线后卫球员（5号 胡明轩）移动速度/体能下降，上3号增加突破得分及外线三分投射。"},
        {"category": "战术建议", "time": "2024-10-20 08:45:23", "text": "对方球员（6号）在进攻端表现出色，需要加强防守。"},
        {"category": "换人", "time": "2024-10-20 12:05:34", "text": "原因：对方球员（4号）在进攻端表现出色，需要加强防守。"},
        {"category": "战术建议", "time": "2024-10-20 15:25:45", "text": "全队战术执行差，锋线球员被针对。需要调整成熟的战术体系。"},
        {"category": "换人", "time": "2024-10-20 18:45:56", "text": "原因：对方外线后卫球员（6号 小明）移动速度/体能下降，上2号增加突破得分及外线三分投射。"},
        {"category": "战术建议", "time": "2024-10-20 22:06:07", "text": "对方球员（5号）在进攻端表现出色，需要加强防守。"},
    ]
    return data